uhnp/src/Catalogs/ТН_Уведомления/ТН_Уведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТН_Уведомления</name>
  <comment>// Луконин Е.А. 09.04.2026 Выполнение задач №000057338</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкиУведомления</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ТН_Уведомления/Forms/ФормаЭлемента/Module.bsl
//////////////////////////////////////////////////////////////////
// Copyright (c) 21.11.2021 Варгасов Д.О. dovargasov@gmail.com  //
////////////////////////////////////////////////////////////////// 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СтруктураКартинокВФорматеHTML = ТекущийОбъект.КартинкиУведомления.Получить();
	
	Если СтруктураКартинокВФорматеHTML = Неопределено Тогда
		СтруктураКартинокВФорматеHTML = Новый Структура;
	КонецЕсли;
	
	СодержаниеФорматированныйДокумент.УстановитьHTML(ТекущийОбъект.Содержание, СтруктураКартинокВФорматеHTML);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.КартинкиУведомления = Неопределено;
	
	СодержаниеФорматированныйДокумент.ПолучитьHTML(ТекущийОбъект.Содержание, СтруктураКартинокВФорматеHTML);
	
	Если ТипЗнч(СтруктураКартинокВФорматеHTML) = Тип("Структура")
		И СтруктураКартинокВФорматеHTML.Количество() > 0 Тогда
		ТекущийОбъект.КартинкиУведомления = Новый ХранилищеЗначения(СтруктураКартинокВФорматеHTML, Новый СжатиеДанных(9));
	КонецЕсли;
	
	ТекущийОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	ТекущийОбъект.Автор = Пользователи.ТекущийПользователь();
	
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ДатаСоздания.Видимость = Не Объект.Ссылка.Пустая();
	Элементы.Автор.Видимость = Не Объект.Ссылка.Пустая();
	
КонецПроцедуры  

#КонецОбласти
